app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2014-04-25 17:27:52.203653"], ["email", "test"], ["updated_at", "2014-04-25 17:27:52.203653"], ["username", "test"]]
---
  def create
    @user = User.new(user_params)
    if @user.save